/* --------------------------------------------------------------
    Öåëûå ÷èñëà ñ íåîãðàíè÷åííîé ðàçðÿäíîé ñåòêîé (âåðñèÿ 2.0).
    Ïîòîêîâûé ââîä-âûâîä.

    http://www.imach.uran.ru/cbignum

    Copyright 1999-2010, Ð.Í.Øàêèðîâ, ÈÌàø ÓðÎ PAH.
    All Rights Reserved.

    Êîä ïðåäîñòàâëÿåòñÿ íà óñëîâèÿõ ëèöåíçèè "public domain",
    ò.å. äîïóñêàåòñÿ ñâîáîäíîå ïðèìåíåíèå, ìîäèôèêàöèÿ è
    ðàñïðîñòðàíåíèå êîäà ïðè óñëîâèè ñîõðàíåíèÿ êîïèðàéòà
    è äîáàâëåíèÿ ñâåäåíèé î âñåõ âíåñåííûõ èçìåíåíèÿõ.

    ÄÀÍÍÎÅ ÏÐÎÃÐÀÌÌÍÎÅ ÎÁÅÑÏÅ×ÅÍÈÅ ÏÐÅÄÎÑÒÀÂËßÅÒÑß "ÊÀÊ ÅÑÒÜ"
    ÁÅÇ ÊÀÊÈÕ-ËÈÁÎ ÃÀÐÀÍÒÈÉ, ßÂÍÛÕ ÈËÈ ÏÎÄÐÀÇÓÌÅÂÀÅÌÛÕ. ÂÛ
    ÈÑÏÎËÜÇÓÅÒÅ ÅÃÎ ÍÀ ÑÂÎÉ ÑÎÁÑÒÂÅÍÍÛÉ ÑÒÐÀÕ È ÐÈÑÊ. ÀÂÒÎÐ
    ÍÅ ÁÓÄÅÒ ÍÅÑÒÈ ÎÒÂÅÒÑÒÂÅÍÍÎÑÒÜ ÇÀ ÓÒÐÀÒÓ ÄÀÍÍÛÕ, ÓÙÅÐÁ,
    ÓÁÛÒÊÈ ÈËÈ ËÞÁÛÅ ÄÐÓÃÈÅ ÂÈÄÛ ÏÎÒÅÐÜ ÏÐÈ ËÞÁÛÕ ÑÏÎÑÎÁÀÕ
    ÈÑÏÎËÜÇÎÂÀÍÈß ÄÀÍÍÎÃÎ ÏÐÎÃÐÀÌÌÍÎÃÎ ÎÁÅÑÏÅ×ÅÍÈß.
-------------------------------------------------------------- */
#ifndef _CBIGNUMS_H
#define _CBIGNUMS_H

#include "Cbignum.h"
#include "Cios.h"

_CIOSTD istream& operator >> (_CIOSTD istream&, cBigNumber&);
_CIOSTD ostream& operator << (_CIOSTD ostream&, const cBigNumber&);

#endif//_CBIGNUMS_H
